Revit 2026 API

# WaveWaveWaveRadius Property

---

The property labeled "Radius" from the "Wave" schema.

**Namespace:** Autodesk.Revit.DB.Visual**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public static string WaveWaveRadius { get; }
```
```vb
Public Shared ReadOnly Property WaveWaveRadius As String
	Get
```
```cpp
public:
static property String^ WaveWaveRadius {
	String^ get ();
}
```
```fsharp
static member WaveWaveRadius : string with get
```

#### Property Value

String

This property is of type "AssetPropertyDouble" within the range of "0, 1000000000".

#### Reference

Wave Class

Autodesk.Revit.DB.Visual Namespace